In [1]:
import pandas as pds                   #import modules and alias the module to pds for future referencedat

In [2]:
dat = pds.read_csv('countries.csv')    #read and load data from file into the variable

In [3]:
print(dat)                             #print the dat variable

          country  year  population
0     Afghanistan  1952     8425333
1     Afghanistan  1957     9240934
2     Afghanistan  1962    10267083
3     Afghanistan  1967    11537966
4     Afghanistan  1972    13079460
...           ...   ...         ...
1699     Zimbabwe  1987     9216418
1700     Zimbabwe  1992    10704340
1701     Zimbabwe  1997    11404948
1702     Zimbabwe  2002    11926563
1703     Zimbabwe  2007    12311143

[1704 rows x 3 columns]

In [4]:
dat.columns                             #read only the header or attributes of columns

Index(['country', 'year', 'population'], dtype='object')

In [5]:
dat.head(5)                             #read only top 5 data set

       country  year  population
0  Afghanistan  1952     8425333
1  Afghanistan  1957     9240934
2  Afghanistan  1962    10267083
3  Afghanistan  1967    11537966
4  Afghanistan  1972    13079460

In [6]:
dat.tail(5)                            #read only bottom 5 data set

       country  year  population
1699  Zimbabwe  1987     9216418
1700  Zimbabwe  1992    10704340
1701  Zimbabwe  1997    11404948
1702  Zimbabwe  2002    11926563
1703  Zimbabwe  2007    12311143

In [9]:
dat.iloc[9]                           #read data based on index location thus iloc

country       Afghanistan
year                 1997
population       22227415
Name: 9, dtype: object

In [10]:
dat.loc[dat['country']=='Nepal']      #retrieve data based on column attributes or headers

     country  year  population
1068   Nepal  1952     9182536
1069   Nepal  1957     9682338
1070   Nepal  1962    10332057
1071   Nepal  1967    11261690
1072   Nepal  1972    12412593
1073   Nepal  1977    13933198
1074   Nepal  1982    15796314
1075   Nepal  1987    17917180
1076   Nepal  1992    20326209
1077   Nepal  1997    23001113
1078   Nepal  2002    25873917
1079   Nepal  2007    28901790

In [12]:
dat.sort_values(['country'],ascending = False)         #sort the data in ascending or descending order

          country  year  population
1703     Zimbabwe  2007    12311143
1697     Zimbabwe  1977     6642107
1692     Zimbabwe  1952     3080907
1693     Zimbabwe  1957     3646340
1694     Zimbabwe  1962     4277736
...           ...   ...         ...
8     Afghanistan  1992    16317921
9     Afghanistan  1997    22227415
10    Afghanistan  2002    25268405
11    Afghanistan  2007    31889923
0     Afghanistan  1952     8425333

[1704 rows x 3 columns]

In [13]:
dat.describe()                  #provide description for the dataset

             year    population
count  1704.00000  1.704000e+03
mean   1979.50000  2.960121e+07
std      17.26533  1.061579e+08
min    1952.00000  6.001100e+04
25%    1965.75000  2.793664e+06
50%    1979.50000  7.023596e+06
75%    1993.25000  1.958522e+07
max    2007.00000  1.318683e+09

In [14]:
col = list(dat.columns.values)

In [16]:
print(col)                              #another way to print the header or attributes

['country', 'year', 'population']

In [17]:
dat.to_csv('country.xlsx')              #convert or save the dataset to another file format